In [1]:
# Importing libraries
import numpy as np
import pandas as pd

In [2]:
# Reading our csv files
df = pd.read_csv('NYCM_100000.csv')

In [3]:
# Getting a random sample of the data
df.sample()

,crash_date,crash_time,borough,zip_code,latitude,longitude,location,on_street_name,off_street_name,cross_street_name,...,contributing_factor_vehicle_2,contributing_factor_vehicle_3,contributing_factor_vehicle_4,contributing_factor_vehicle_5,collision_id,vehicle_type_code1,vehicle_type_code2,vehicle_type_code_3,vehicle_type_code_4,vehicle_type_code_5
49570,2020-09-29T00:00:00.000,10:03,MANHATTAN,10003.0,40.73202,-73.984184,"(40.73202, -73.984184)",NaN,NaN,324 EAST 14 STREET,...,Following Too Closely,NaN,NaN,NaN,4353141,Sedan,Sedan,NaN,NaN,NaN

In [4]:
# Getting an idea of what datetypes exist in the dataframe
df.dtypes

crash_date                        object
crash_time                        object
borough                           object
zip_code                         float64
latitude                         float64
longitude                        float64
location                          object
on_street_name                    object
off_street_name                   object
cross_street_name                 object
number_of_persons_injured          int64
number_of_persons_killed           int64
number_of_pedestrians_injured      int64
number_of_pedestrians_killed       int64
number_of_cyclist_injured          int64
number_of_cyclist_killed           int64
number_of_motorist_injured         int64
number_of_motorist_killed          int64
contributing_factor_vehicle_1     object
contributing_factor_vehicle_2     object
contributing_factor_vehicle_3     object
contributing_factor_vehicle_4     object
contributing_factor_vehicle_5     object
collision_id                       int64
vehicle_type_code1                object
vehicle_type_code2                object
vehicle_type_code_3               object
vehicle_type_code_4               object
vehicle_type_code_5               object
dtype: object

In [5]:
# Changing 'crash_date' format to it's panda's datetime format
df['crash_date'] = pd.to_datetime(df['crash_date'])

In [6]:
# A try to convert 'crash_time' to panda's time format
# But it won't happen why ? because the original time enteries is missing to mention 'seconds'
# we need to bring it from H:M to H:M:S
df['crash_time'] = pd.to_timedelta(df['crash_time'])

ValueError: expected hh:mm:ss format

In [8]:
# Doing a trick and adding our self the missing seconds.
df['crash_time'] = df['crash_time'].apply(lambda x:x+':00')

In [9]:
# This time we are successful to convert the 'crash_time' into actual panda's time format.
df['crash_time']=pd.to_timedelta(df['crash_time'])

In [10]:
# Proof of workflow
df['crash_time']

0       0 days 23:10:00
1       0 days 13:00:00
2       0 days 17:15:00
3       0 days 20:10:00
4       0 days 14:00:00
              ...
99995   0 days 15:00:00
99996   0 days 11:22:00
99997   0 days 21:30:00
99998   0 days 17:28:00
99999   0 days 20:42:00
Name: crash_time, Length: 100000, dtype: timedelta64[ns]

In [11]:
# Looking at the changes we made.
df.dtypes

crash_date                        datetime64[ns]
crash_time                       timedelta64[ns]
borough                                   object
zip_code                                 float64
latitude                                 float64
longitude                                float64
location                                  object
on_street_name                            object
off_street_name                           object
cross_street_name                         object
number_of_persons_injured                  int64
number_of_persons_killed                   int64
number_of_pedestrians_injured              int64
number_of_pedestrians_killed               int64
number_of_cyclist_injured                  int64
number_of_cyclist_killed                   int64
number_of_motorist_injured                 int64
number_of_motorist_killed                  int64
contributing_factor_vehicle_1             object
contributing_factor_vehicle_2             object
contributing_factor_vehicle_3             object
contributing_factor_vehicle_4             object
contributing_factor_vehicle_5             object
collision_id                               int64
vehicle_type_code1                        object
vehicle_type_code2                        object
vehicle_type_code_3                       object
vehicle_type_code_4                       object
vehicle_type_code_5                       object
dtype: object

In [12]:
#Creating a new column forged from 'crash_date'+'crash_time'
df['DateTime'] = df['crash_date'] + df['crash_time']

In [13]:
# We can see the newly created 'DateTime' column at the end of the columns.
df.head()

,crash_date,crash_time,borough,zip_code,latitude,longitude,location,on_street_name,off_street_name,cross_street_name,...,contributing_factor_vehicle_3,contributing_factor_vehicle_4,contributing_factor_vehicle_5,collision_id,vehicle_type_code1,vehicle_type_code2,vehicle_type_code_3,vehicle_type_code_4,vehicle_type_code_5,DateTime
0,2017-04-18,0 days 23:10:00,STATEN ISLAND,10312.0,40.536728,-74.193344,"(40.536728, -74.193344)",NaN,NaN,243 DARLINGTON AVENUE,...,NaN,NaN,NaN,3654181,Station Wagon/Sport Utility Vehicle,NaN,NaN,NaN,NaN,2017-04-18 23:10:00
1,2017-05-06,0 days 13:00:00,BRONX,10472.0,40.829052,-73.850380,"(40.829052, -73.85038)",CASTLE HILL AVENUE,BLACKROCK AVENUE,NaN,...,NaN,NaN,NaN,3665311,Sedan,NaN,NaN,NaN,NaN,2017-05-06 13:00:00
2,2017-04-27,0 days 17:15:00,QUEENS,11420.0,40.677303,-73.804565,"(40.677303, -73.804565)",135 STREET,FOCH BOULEVARD,NaN,...,NaN,NaN,NaN,3658491,Sedan,Sedan,NaN,NaN,NaN,2017-04-27 17:15:00
3,2017-05-09,0 days 20:10:00,NaN,NaN,40.624958,-74.145775,"(40.624958, -74.145775)",FOREST AVENUE,RICHMOND AVENUE,NaN,...,Unspecified,NaN,NaN,3666554,Motorcycle,Sedan,Bus,NaN,NaN,2017-05-09 20:10:00
4,2017-04-18,0 days 14:00:00,BRONX,10456.0,40.828846,-73.903120,"(40.828846, -73.90312)",NaN,NaN,1167 BOSTON ROAD,...,NaN,NaN,NaN,3653269,Sedan,Station Wagon/Sport Utility Vehicle,NaN,NaN,NaN,2017-04-18 14:00:00

In [14]:
# Since we forged a column with success, it is time get rid of useless 2 column; 'crash_date','crash_time'.
df.drop(['crash_date','crash_time'],axis=1,inplace=True)

In [15]:
# Proof of workflow.
df.head()

,borough,zip_code,latitude,longitude,location,on_street_name,off_street_name,cross_street_name,number_of_persons_injured,number_of_persons_killed,...,contributing_factor_vehicle_3,contributing_factor_vehicle_4,contributing_factor_vehicle_5,collision_id,vehicle_type_code1,vehicle_type_code2,vehicle_type_code_3,vehicle_type_code_4,vehicle_type_code_5,DateTime
0,STATEN ISLAND,10312.0,40.536728,-74.193344,"(40.536728, -74.193344)",NaN,NaN,243 DARLINGTON AVENUE,0,0,...,NaN,NaN,NaN,3654181,Station Wagon/Sport Utility Vehicle,NaN,NaN,NaN,NaN,2017-04-18 23:10:00
1,BRONX,10472.0,40.829052,-73.850380,"(40.829052, -73.85038)",CASTLE HILL AVENUE,BLACKROCK AVENUE,NaN,1,0,...,NaN,NaN,NaN,3665311,Sedan,NaN,NaN,NaN,NaN,2017-05-06 13:00:00
2,QUEENS,11420.0,40.677303,-73.804565,"(40.677303, -73.804565)",135 STREET,FOCH BOULEVARD,NaN,0,0,...,NaN,NaN,NaN,3658491,Sedan,Sedan,NaN,NaN,NaN,2017-04-27 17:15:00
3,NaN,NaN,40.624958,-74.145775,"(40.624958, -74.145775)",FOREST AVENUE,RICHMOND AVENUE,NaN,1,0,...,Unspecified,NaN,NaN,3666554,Motorcycle,Sedan,Bus,NaN,NaN,2017-05-09 20:10:00
4,BRONX,10456.0,40.828846,-73.903120,"(40.828846, -73.90312)",NaN,NaN,1167 BOSTON ROAD,0,0,...,NaN,NaN,NaN,3653269,Sedan,Station Wagon/Sport Utility Vehicle,NaN,NaN,NaN,2017-04-18 14:00:00

In [16]:
# Now taking care of missing values
# Taking a glance of "How many missing value" are we talking about
df.isnull().sum()

borough                          35026
zip_code                         35034
latitude                          8035
longitude                         8035
location                          8035
on_street_name                   26009
off_street_name                  52875
cross_street_name                74033
number_of_persons_injured            0
number_of_persons_killed             0
number_of_pedestrians_injured        0
number_of_pedestrians_killed         0
number_of_cyclist_injured            0
number_of_cyclist_killed             0
number_of_motorist_injured           0
number_of_motorist_killed            0
contributing_factor_vehicle_1      371
contributing_factor_vehicle_2    19243
contributing_factor_vehicle_3    91239
contributing_factor_vehicle_4    97760
contributing_factor_vehicle_5    99333
collision_id                         0
vehicle_type_code1                 740
vehicle_type_code2               26589
vehicle_type_code_3              91671
vehicle_type_code_4              97853
vehicle_type_code_5              99354
DateTime                             0
dtype: int64

In [17]:
# making a list of all possible columns containing missing values.
null_list=[i for i in df.columns if df[i].isnull().sum() > 1]

In [18]:
# Calling the list.
null_list

['borough',
 'zip_code',
 'latitude',
 'longitude',
 'location',
 'on_street_name',
 'off_street_name',
 'cross_street_name',
 'contributing_factor_vehicle_1',
 'contributing_factor_vehicle_2',
 'contributing_factor_vehicle_3',
 'contributing_factor_vehicle_4',
 'contributing_factor_vehicle_5',
 'vehicle_type_code1',
 'vehicle_type_code2',
 'vehicle_type_code_3',
 'vehicle_type_code_4',
 'vehicle_type_code_5']

In [19]:
# This list contains a 3 int64 datatype that we need to clean first-
# so we can apply string modules on the rest (object data types).
b=['zip_code','latitude','longitude']
object_null_list= [i for i in null_list if i not in b]

In [20]:
# Created a list of all columns with "Object" Datatype
object_null_list

['borough',
 'location',
 'on_street_name',
 'off_street_name',
 'cross_street_name',
 'contributing_factor_vehicle_1',
 'contributing_factor_vehicle_2',
 'contributing_factor_vehicle_3',
 'contributing_factor_vehicle_4',
 'contributing_factor_vehicle_5',
 'vehicle_type_code1',
 'vehicle_type_code2',
 'vehicle_type_code_3',
 'vehicle_type_code_4',
 'vehicle_type_code_5']

In [21]:
# Making sure where the object is np.NAN, we replace is with the string 'Unspecified'
df[object_null_list]=df[object_null_list].apply(lambda x: x.fillna('Unspecified'))

In [22]:
# Proof of that our trick worked, Now let's take care of the columns
# With the int64 datatype
df.isnull().sum()

borough                              0
zip_code                         35034
latitude                          8035
longitude                         8035
location                             0
on_street_name                       0
off_street_name                      0
cross_street_name                    0
number_of_persons_injured            0
number_of_persons_killed             0
number_of_pedestrians_injured        0
number_of_pedestrians_killed         0
number_of_cyclist_injured            0
number_of_cyclist_killed             0
number_of_motorist_injured           0
number_of_motorist_killed            0
contributing_factor_vehicle_1        0
contributing_factor_vehicle_2        0
contributing_factor_vehicle_3        0
contributing_factor_vehicle_4        0
contributing_factor_vehicle_5        0
collision_id                         0
vehicle_type_code1                   0
vehicle_type_code2                   0
vehicle_type_code_3                  0
vehicle_type_code_4                  0
vehicle_type_code_5                  0
DateTime                             0
dtype: int64

In [23]:
# Here we are making sure to replace np.NAN columns values with a proper 0, (float) format.
df[b]=df[b].apply(lambda x:x.fillna(0,))

In [24]:
# Proof of working flow
df.isnull().sum()

borough                          0
zip_code                         0
latitude                         0
longitude                        0
location                         0
on_street_name                   0
off_street_name                  0
cross_street_name                0
number_of_persons_injured        0
number_of_persons_killed         0
number_of_pedestrians_injured    0
number_of_pedestrians_killed     0
number_of_cyclist_injured        0
number_of_cyclist_killed         0
number_of_motorist_injured       0
number_of_motorist_killed        0
contributing_factor_vehicle_1    0
contributing_factor_vehicle_2    0
contributing_factor_vehicle_3    0
contributing_factor_vehicle_4    0
contributing_factor_vehicle_5    0
collision_id                     0
vehicle_type_code1               0
vehicle_type_code2               0
vehicle_type_code_3              0
vehicle_type_code_4              0
vehicle_type_code_5              0
DateTime                         0
dtype: int64

In [25]:
# Getting a back another glance to see how the change are looking
df.sample()

,borough,zip_code,latitude,longitude,location,on_street_name,off_street_name,cross_street_name,number_of_persons_injured,number_of_persons_killed,...,contributing_factor_vehicle_3,contributing_factor_vehicle_4,contributing_factor_vehicle_5,collision_id,vehicle_type_code1,vehicle_type_code2,vehicle_type_code_3,vehicle_type_code_4,vehicle_type_code_5,DateTime
38734,Unspecified,0.0,40.65161,-74.01062,"(40.65161, -74.01062)",GOWANUS EXPY (BQE),Unspecified,Unspecified,1,0,...,Unspecified,Unspecified,Unspecified,4182241,Station Wagon/Sport Utility Vehicle,Sedan,Unspecified,Unspecified,Unspecified,2019-07-31 00:35:00

In [26]:
# Let's take care of the begining and trailing blank space in our columns values
object_types=[i for i in df.columns if df.dtypes[i]== np.object]

In [27]:
# Making sure that the strip does its job, and it does
for i in object_types:
    df[i].map(lambda x: x.strip())

In [28]:
# Since this table has got a beautifull "Collision_id" we can use it
# to take out any duplicate data if exists
dup = df[df.duplicated(['collision_id'])]

In [29]:
# Luckily our dataframe has got no duplicate data enteries
dup

Empty DataFrame
Columns: [borough, zip_code, latitude, longitude, location, on_street_name, off_street_name, cross_street_name, number_of_persons_injured, number_of_persons_killed, number_of_pedestrians_injured, number_of_pedestrians_killed, number_of_cyclist_injured, number_of_cyclist_killed, number_of_motorist_injured, number_of_motorist_killed, contributing_factor_vehicle_1, contributing_factor_vehicle_2, contributing_factor_vehicle_3, contributing_factor_vehicle_4, contributing_factor_vehicle_5, collision_id, vehicle_type_code1, vehicle_type_code2, vehicle_type_code_3, vehicle_type_code_4, vehicle_type_code_5, DateTime]
Index: []

[0 rows x 28 columns]

In [30]:
# Finally we can gladly save our cleaned version of the dataframe in our 
# Newly created custom csv file
df.to_csv('CleanedNYCM.csv', index=False)

In [31]:
dtf = pd.read_csv('CleanedNYCM.csv')

In [32]:
dtf.head()

,borough,zip_code,latitude,longitude,location,on_street_name,off_street_name,cross_street_name,number_of_persons_injured,number_of_persons_killed,...,contributing_factor_vehicle_3,contributing_factor_vehicle_4,contributing_factor_vehicle_5,collision_id,vehicle_type_code1,vehicle_type_code2,vehicle_type_code_3,vehicle_type_code_4,vehicle_type_code_5,DateTime
0,STATEN ISLAND,10312.0,40.536728,-74.193344,"(40.536728, -74.193344)",Unspecified,Unspecified,243 DARLINGTON AVENUE,0,0,...,Unspecified,Unspecified,Unspecified,3654181,Station Wagon/Sport Utility Vehicle,Unspecified,Unspecified,Unspecified,Unspecified,2017-04-18 23:10:00
1,BRONX,10472.0,40.829052,-73.850380,"(40.829052, -73.85038)",CASTLE HILL AVENUE,BLACKROCK AVENUE,Unspecified,1,0,...,Unspecified,Unspecified,Unspecified,3665311,Sedan,Unspecified,Unspecified,Unspecified,Unspecified,2017-05-06 13:00:00
2,QUEENS,11420.0,40.677303,-73.804565,"(40.677303, -73.804565)",135 STREET,FOCH BOULEVARD,Unspecified,0,0,...,Unspecified,Unspecified,Unspecified,3658491,Sedan,Sedan,Unspecified,Unspecified,Unspecified,2017-04-27 17:15:00
3,Unspecified,0.0,40.624958,-74.145775,"(40.624958, -74.145775)",FOREST AVENUE,RICHMOND AVENUE,Unspecified,1,0,...,Unspecified,Unspecified,Unspecified,3666554,Motorcycle,Sedan,Bus,Unspecified,Unspecified,2017-05-09 20:10:00
4,BRONX,10456.0,40.828846,-73.903120,"(40.828846, -73.90312)",Unspecified,Unspecified,1167 BOSTON ROAD,0,0,...,Unspecified,Unspecified,Unspecified,3653269,Sedan,Station Wagon/Sport Utility Vehicle,Unspecified,Unspecified,Unspecified,2017-04-18 14:00:00

In [33]:
dtf.isnull().sum()

borough                          0
zip_code                         0
latitude                         0
longitude                        0
location                         0
on_street_name                   0
off_street_name                  0
cross_street_name                0
number_of_persons_injured        0
number_of_persons_killed         0
number_of_pedestrians_injured    0
number_of_pedestrians_killed     0
number_of_cyclist_injured        0
number_of_cyclist_killed         0
number_of_motorist_injured       0
number_of_motorist_killed        0
contributing_factor_vehicle_1    0
contributing_factor_vehicle_2    0
contributing_factor_vehicle_3    0
contributing_factor_vehicle_4    0
contributing_factor_vehicle_5    0
collision_id                     0
vehicle_type_code1               0
vehicle_type_code2               0
vehicle_type_code_3              0
vehicle_type_code_4              0
vehicle_type_code_5              0
DateTime                         0
dtype: int64